MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX370F512L.PIC
      <edc:SFRDef edc:_addr="0x1F886460" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNPDE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNPDE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDE0" edc:desc="" edc:mask="0x1" edc:name="CNPDE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE1" edc:desc="" edc:mask="0x1" edc:name="CNPDE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE2" edc:desc="" edc:mask="0x1" edc:name="CNPDE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE3" edc:desc="" edc:mask="0x1" edc:name="CNPDE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE4" edc:desc="" edc:mask="0x1" edc:name="CNPDE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE5" edc:desc="" edc:mask="0x1" edc:name="CNPDE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE6" edc:desc="" edc:mask="0x1" edc:name="CNPDE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE7" edc:desc="" edc:mask="0x1" edc:name="CNPDE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE8" edc:desc="" edc:mask="0x1" edc:name="CNPDE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE9" edc:desc="" edc:mask="0x1" edc:name="CNPDE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886470" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------n-n-------------" edc:cname="CNCONE" edc:desc="" edc:grp="PORTE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNCONE" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886480" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNENE" edc:desc="" edc:grp="PORTE" edc:impl="0xffc003ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000------------xxxxxxxxxx" edc:name="CNENE" edc:nzwidth="0x20" edc:por="0000000000------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEE0" edc:desc="" edc:mask="0x1" edc:name="CNIEE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE1" edc:desc="" edc:mask="0x1" edc:name="CNIEE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE2" edc:desc="" edc:mask="0x1" edc:name="CNIEE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE3" edc:desc="" edc:mask="0x1" edc:name="CNIEE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE4" edc:desc="" edc:mask="0x1" edc:name="CNIEE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE5" edc:desc="" edc:mask="0x1" edc:name="CNIEE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE6" edc:desc="" edc:mask="0x1" edc:name="CNIEE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE7" edc:desc="" edc:mask="0x1" edc:name="CNIEE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE8" edc:desc="" edc:mask="0x1" edc:name="CNIEE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE9" edc:desc="" edc:mask="0x1" edc:name="CNIEE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886490" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNSTATE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNSTATE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATE0" edc:desc="" edc:mask="0x1" edc:name="CNSTATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE1" edc:desc="" edc:mask="0x1" edc:name="CNSTATE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE2" edc:desc="" edc:mask="0x1" edc:name="CNSTATE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE3" edc:desc="" edc:mask="0x1" edc:name="CNSTATE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE4" edc:desc="" edc:mask="0x1" edc:name="CNSTATE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE5" edc:desc="" edc:mask="0x1" edc:name="CNSTATE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE6" edc:desc="" edc:mask="0x1" edc:name="CNSTATE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE7" edc:desc="" edc:mask="0x1" edc:name="CNSTATE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE8" edc:desc="" edc:mask="0x1" edc:name="CNSTATE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE9" edc:desc="" edc:mask="0x1" edc:name="CNSTATE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8864A0" edc:offset="96"/>
      <edc:SFRDef edc:_addr="0x1F886500" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="--------------------------------" edc:cname="ANSELF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="ANSELF" edc:nzwidth="0x20" edc:por="--------------------------------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886510" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="------------------nn---nnnnnnnnn" edc:cname="TRISF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff31ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------11---111111111" edc:name="TRISF" edc:nzwidth="0x20" edc:por="------------------11---111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF2" edc:desc="" edc:mask="0x1" edc:name="TRISF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF3" edc:desc="" edc:mask="0x1" edc:name="TRISF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF4" edc:desc="" edc:mask="0x1" edc:name="TRISF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF5" edc:desc="" edc:mask="0x1" edc:name="TRISF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF6" edc:desc="" edc:mask="0x1" edc:name="TRISF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF7" edc:desc="" edc:mask="0x1" edc:name="TRISF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF8" edc:desc="" edc:mask="0x1" edc:name="TRISF8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISF12" edc:desc="" edc:mask="0x1" edc:name="TRISF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISF13" edc:desc="" edc:mask="0x1" edc:name="TRISF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886520" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="------------------nn---nnnnnnnnn" edc:cname="PORTF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff31ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx---xxxxxxxxx" edc:name="PORTF" edc:nzwidth="0x20" edc:por="------------------xx---xxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF2" edc:desc="" edc:mask="0x1" edc:name="RF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF3" edc:desc="" edc:mask="0x1" edc:name="RF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF4" edc:desc="" edc:mask="0x1" edc:name="RF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF6" edc:desc="" edc:mask="0x1" edc:name="RF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF7" edc:desc="" edc:mask="0x1" edc:name="RF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF8" edc:desc="" edc:mask="0x1" edc:name="RF8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RF12" edc:desc="" edc:mask="0x1" edc:name="RF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RF13" edc:desc="" edc:mask="0x1" edc:name="RF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886530" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="------------------nn---nnnnnnnnn" edc:cname="LATF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff31ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx---xxxxxxxxx" edc:name="LATF" edc:nzwidth="0x20" edc:por="------------------xx---xxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATF0" edc:desc="" edc:mask="0x1" edc:name="LATF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF1" edc:desc="" edc:mask="0x1" edc:name="LATF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF2" edc:desc="" edc:mask="0x1" edc:name="LATF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF3" edc:desc="" edc:mask="0x1" edc:name="LATF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF4" edc:desc="" edc:mask="0x1" edc:name="LATF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF5" edc:desc="" edc:mask="0x1" edc:name="LATF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF6" edc:desc="" edc:mask="0x1" edc:name="LATF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF7" edc:desc="" edc:mask="0x1" edc:name="LATF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF8" edc:desc="" edc:mask="0x1" edc:name="LATF8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATF12" edc:desc="" edc:mask="0x1" edc:name="LATF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATF13" edc:desc="" edc:mask="0x1" edc:name="LATF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886540" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="------------------nn---nnnnnnnnn" edc:cname="ODCF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff31ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---000000000" edc:name="ODCF" edc:nzwidth="0x20" edc:por="------------------00---000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCF0" edc:desc="" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF1" edc:desc="" edc:mask="0x1" edc:name="ODCF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF2" edc:desc="" edc:mask="0x1" edc:name="ODCF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF3" edc:desc="" edc:mask="0x1" edc:name="ODCF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF4" edc:desc="" edc:mask="0x1" edc:name="ODCF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF5" edc:desc="" edc:mask="0x1" edc:name="ODCF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF6" edc:desc="" edc:mask="0x1" edc:name="ODCF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF7" edc:desc="" edc:mask="0x1" edc:name="ODCF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF8" edc:desc="" edc:mask="0x1" edc:name="ODCF8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF12" edc:desc="" edc:mask="0x1" edc:name="ODCF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCF13" edc:desc="" edc:mask="0x1" edc:name="ODCF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886550" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="------------------nn---nnnnnnnnn" edc:cname="CNPUF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff31ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx---xxxxxxxxx" edc:name="CNPUF" edc:nzwidth="0x20" edc:por="------------------xx---xxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUF0" edc:desc="" edc:mask="0x1" edc:name="CNPUF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF1" edc:desc="" edc:mask="0x1" edc:name="CNPUF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF2" edc:desc="" edc:mask="0x1" edc:name="CNPUF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF3" edc:desc="" edc:mask="0x1" edc:name="CNPUF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF4" edc:desc="" edc:mask="0x1" edc:name="CNPUF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF5" edc:desc="" edc:mask="0x1" edc:name="CNPUF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF6" edc:desc="" edc:mask="0x1" edc:name="CNPUF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF7" edc:desc="" edc:mask="0x1" edc:name="CNPUF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF8" edc:desc="" edc:mask="0x1" edc:name="CNPUF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF12" edc:desc="" edc:mask="0x1" edc:name="CNPUF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF13" edc:desc="" edc:mask="0x1" edc:name="CNPUF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
